#= ==========================================================================================
=============================================================================================
params
=============================================================================================
========================================================================================== =#

# space
xlims = (-50, 50); # μm

# fluid
# water viscosity ≡ μ = 0.890 mPa s, water density ≡ ρ = 1000 kg/m³ → water kinematic shear viscosity ≡ ν ≡ μ/ρ = 0.890 (μm)²/(μs),
viscosity = 0.890 # (μm)²/(μs)

# squirmer
radius = 4;
slipSpeed = 1e-4;
beta = -5;
coupleTorques = true;
coupleForces = true;

# simulation
simulationTime = 20e3; # μs
ticksSaved = 100;
